#define _CRT_SECURE_NO_WARNINGS 1
#include<stdio.h>
//整形家族
//浮点型家族
//构造类型——自定义类型
  //数组类型
  //struct结构体类型
  //enum枚举类型
  //union联合体类型
  // 
//指针类型
//空类型
// void
//函数的返回类型
// 
//
//int main()
//{
//	int a = -10;
//	//10000000000000000000000000001010;原码
//	//11111111111111111111111111110101;反码
//	//11111111111111111111111111110110;补码
//	//f   f   f   f   f   f   f   6
//	//在内存中存储的是补码
//	//大端小端：
//	//
//	return 0;
//}
// 在内存中在以2进制的形式存储
//对于整数来说：
//整数二进制有3种表现形式：原码补码反码
//负整数：
// 按照数据数值直接写出的二进制序列就是原码
// 原码符号位不变，其他位按位取反，得到的就是反码
// 反码+1得到的就是补码
//
//int main()
//{
//	//1+(-1);
//	//00000000000000000000000000000001
//	//10000000000000000000000000000001
//	return 0;
//}
//int main()
//{
//	int a = 0x34564333;
//	return 0;
//}
